[
  {
    "date": "april 2025 - today",
    "title": "Python Backend Engineer",
    "company": "PwC Argentina",
    "description": "Design and development of Python backend software.",
    "tasks":[      
      "Develop RESTful API using FastAPI and SQLModel for agent-based text modification system.",
      "Implement LLM agent integration with Langfuse for text processing across 13 languages.",
      "Design and implement repository pattern and registry pattern for scalable backend architecture."
    ],    
    "feats":[
      "Built API system enabling automated text modification following company guidelines.",
      "Integrated Langfuse for LLM observability and monitoring in production environment.",
      "Implemented multi-language support for text processing across 13 different languages.",
      "Applied repository pattern and registry pattern following backend best practices.",
      "Developed Pydantic models ensuring data validation and type safety throughout the system.",
      "Created agent-based architecture allowing seamless LLM integration for text transformation."
    ]
  },
    {
    "date": "april 2020 - march 2025",
    "title": "Software Developer",
    "company": "L.I.E. S.R.L.",
    "description": "Design and development of Python aplications.",
    "tasks":[      
      "Develop software to improve After-sales service.",
      "Develop software to improve the supplier purchasing system.",
      "Set up a local server with Windows Server 2012."
    ],    
    "feats":[
      "Solely responsible for the department of software development",
      "Incorporate new technologies into the company through software development.",
      "Improve the company's After-sales service thanks to the TECSEG system.",
      "Update the purchasing order system creating the GEST2020 software.",
      "Reduce response times of the purchasing and list printing system.",
      "Install a local server to manage the systems."
    ]
  },
  {
    "date": "may 2012 - march 2020",
    "title": "IT technician",
    "company": "L.I.E. S.R.L.",
    "description": "LabVIEW system developer and programming of digital TV equipments.",
    "tasks":[
      "Development of software for telemetry and remote control of high-power TV equipment.",
      "Programming of digital TV equipment (Encoders, Multiplexers, Modulators, Etc.)",
      "In charge of general computer maintenance and design of the Local Network."
    ],
    "feats":[
      "Incorporate a new product to market (XME V7 Telemetry).",
      "Provide customers with the possibility of telecommanding high-power equipment.",
      "Integrate new equipment models into the software, developing 7 versions of the XME system.",
      "Program all the equipments of the CH13 SFN digital TV network of the Province of San Luis, among others."
    ]      
  }
]